In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(thresh=2) # Define q vai excluir linhas que possuem 2 valores faltantes

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value='NULL') # Preenche NaN com o valor do value

      A     B  C
0   1.0   5.0  1
1   2.0  NULL  2
2  NULL  NULL  3

In [10]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
df.fillna(method='ffill') # Preenche com o ultimo valor adicionado/lido

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3